app/Controllers/CustomerController.php

SELECT *
FROM `customer`
---
    public function index()
    {
        $model = new CustomerModel();
        $data['customer'] = $model->findAll();