app/Controllers/KendaraanController.php

    public function index()
    {
        $model = new KendaraanModel();
        $data['kendaraan'] = $model->findAll();
---
SELECT *
FROM `kendaraan`