app/Controllers/LaporanTransaksiController.php

    public function index()
    {
        $model = new LaporanTransaksiModel();
        $data['laporan_transaksi'] = $model->findAll();
---
SELECT *
FROM `laporan_transaksi`