app/Controllers/SopirController.php

SELECT *
FROM `sopir`
---
    public function index()
    {
        $model = new SopirModel();
        $data['sopir'] = $model->findAll();