app/Controllers/TransaksiController.php

SELECT *
FROM `transaksi`
---
    public function index()
    {
        $model = new TransaksiModel();
        $data['transaksi'] = $model->findAll();